Repository: mozilla-l10n/mt-training-data
Catalog: cnh/cnh_pontoon.tmx
Source language: en_us
Languages: cnh

source: The Common Voice dataset complements Mozilla’s open source voice recognition engine Deep Speech. The first version of Deep Speech was released in November 2017 and has continued to evolve ever since. Together with the Common Voice dataset, we believe this open source voice recognition technology should be available to everybody. It’s our hope these technologies will enable developers to build a wave of innovative products and services.
cnh: Mozilla aw hngalh khawhnak Deep Speech seh hi Common Voice dataset nih tlam a tlinter. Ahmasa bik Deep Speech hi November 2017 ah rak chuah in ngol loin a karh peng. Common Voice dataset he hmunkhat in, aw in chawnh mi technology hi ahopoah nih an hman khawh ding a si ti hi kan zumh. Aw theihnak le chawnhnak technology pawl nih hin computer thiam pawl hi santlai thil thar tampi a ser ter khawh hna lai ti hi kan i ruahchan.

source: The Common Voice dataset complements Mozilla’s open source voice recognition engine Deep Speech, which you can use to build speech recognition applications. Read our <githubLink>Github overview</githubLink> or join the <discourseLink>DeepSpeech Discourse</discourseLink> to learn how to get started.
cnh: Mozilla nih a tinhmi, zalong tein mipi caah holh lei fimthiamnak ser khawhnak ding hi, Common Voice zong nih a cohlan i a zulh ve. <githubLink> Github </githubLink> ah rel ve, silole <discourseLink> DeepSpeech Discourse</discourseLink> ah a hman ning rak cawng ve.

source: The Common Voice Dataset contains hundreds of thousands of voice samples that help developers build voice recognition tools.
cnh: Common Voice Dataset ah a thongthong in tuncia mi aw tampi kan ngeih.

source: The Common Voice dataset is an open and publicly available resource that can be used to train a wide variety of speech-enabled applications. To protect the security of our contributors, we ask everyone who downloads the Common Voice dataset to respect contributors’ privacy. All voice clips in the dataset are scrubbed of personally identifying information. When you download the dataset, you agree to not attempt to determine the identity of any contributor. That means you cannot try to link information in the dataset to a contributor’s personal information. You may, however, use the dataset to train speech recognition, speaker recognition, or other applications, by, for instance, linking information in the dataset to other information already in the dataset.
cnh: Common Voice i pumhmi data hi zapi nih holh lei he petlaih mi thil poah ah ahopoah nih hman khawh mi a si. A kan bawmhtu himnak ah, Common Voice i pumhmi data a download mi poah nih bawmtu himbawmnak nan kilven in nan upat lai kan in nawl hna. Aw-tun mi vialte ah pumpak kong a langhter mi thil poah cu hlonh dih an si. Hi pumhmi data na download tikah, bawmtu hi ahodah an si ti hngalhnak tuah na tim lai lo ti lungtlinnak ngeih a si. A sullam cu hi aw hi aho thengte dah a si ti kha na kawl lai lo.

source: The Common Voice dataset is available for download under the <licenseLink>CC0</licenseLink> license on <datasetLink>our Datasets page</datasetLink>. You can also download several other publicly available datasets from the same page.
cnh: Common Voice dataset cu <licenseLink>CC0</licenseLink> lisen in <datasetLink> Datasets </datasetLink> ah download a ngah. A dang mizapi nih hman dingin khon mi thil pawl zong download khawh a si.

source: The count of voice recording hours that have been validated by 2 out of 3 users with a vote of “Yes”. These mark progress toward the overall project 10k hours goal.
cnh: A kan bawmtu minung 3 chungah 2 nih "a si" tiah biatlang an chek cangmi. Hi nih hin kan i tinhmi suimilam thonghra 10 cu a langhter.

source: The count of voice recording hours we have collected so far.
cnh: Suimilam kan tuncia mi vialte zohnak.

source: The current sentences come from contributor donations, as well as dialogue from public domain movie scripts like <italic>It’s a Wonderful Life.</italic>
cnh: Hi biatlang hna hi bawmchantu in siseh, mipi holhnak in, cun caṭial mi,<italic> Kenneth Van Bik Dictionary </italic>, ti bantuk in kan lak mi a si.

source: The dataset is available now on our <downloadLink>download page</downloadLink> under the <licenseLink>CC-0</licenseLink> license.
cnh: Pumhmi Data cu dawnlok a ngah <downloadLink> dawnlok nak</downloadLink> i a tang <licenseLink>CC-0</licenseLink> laisen.

source: The goal of the Common Voice dataset is to enable anyone in the world to build speech recognition, speaker recognition, or any other type of application that requires voice data. A voice assistant is just one of many types of applications you could use the dataset to build.
cnh: Common Voice dataset nih a tinhmi cu vawlei cung kip ah mah le holh cio in computer chawnh khawhnak le aw lei he pehtlai in thil ṭha tampi sernak lam kawl hi a si. Computer kan chawnh tikah a kan let khotu, Siri, tibantuk khi tampi in ser khawh kan duh.

source: The multi-language version of the Common Voice dataset is currently undergoing community supported bundling and cleaning. If you would like to help us bring Common Voice to new languages, go check out the <sentenceCollectorLink>Sentence Collection Tool</sentenceCollectorLink> for adding new sentences to the dataset, and Mozilla <pontoonLink>Pontoon</pontoonLink> for translating the website itself. New languages are added to Common Voice for voice contribution when 5000 approved sentences have been collected.
cnh: Atu lio ah, holh phunkip in Common Voice dataset hi zatlangbu nih bawmh in kan ser lio. Common Voice hi holh thar in karhter dingah bawmh na duh si cun, biatlang thar khumh nak ding <sentenceCollectorLink> Sentence Collection Tool </sentenceCollectorLink> le amah a website pi lehnak ding Mozilla <pontoonLink> Pontoon </pontoonLink> hi va ngiathlai. Holh thar hi cohlan mi biatlang 5000 khawmh hnu lawngah Common Voice ah khumh a si.

source: The number of recordings and which languages you contribute to will be public.
cnh: Aw na tunmi zat le zeiholh in dah na holh timi cu mipi sinah a lang lai

source: The process by which a contributor’s profile information is obscured from their donated voice clips when packaged for download as a part of the dataset.
cnh: Midang nih kan pumhmi data an dawnlok tikah nangmah kong vialte kan langhter lonak a si.

source: The recording was too long.
cnh: Na tunmi a sau tuk.

source: The recording was too quiet.
cnh: Na tunmi a din tuk.

source: The recording was too short.
cnh: Na tunmi a tawi tuk.

source: These languages are currently under community development. The progress bars indicate how far each language is in the process of <localizationGlossaryLink>website localization</localizationGlossaryLink> and <sentenceCollectionGlossaryLink>sentence collection</sentenceCollectionGlossaryLink>.
cnh: Hi holhphun hna cu an miphun nih ser cuahmah lio an si. An ṭuanzat hna cu hi ka ah hin zoh khawh an si hna <localizationGlossaryLink> Website lehnak </localizationGlossaryLink> le <sentenceCollectionGlossaryLink> biatlang khawmhnak </sentenceCollectionGlossaryLink>.

source: The selected file is too large
cnh: Na thimmi a lian tuk

source: The sentence has a grammatical or spelling error.
cnh: A biatlang nih gramma silole biafang ṭial a palh.

source: The sentence has disrespectful or offensive language.
cnh: Hi biatlang ah biachia siloah midang zomhteihnak a tel.

source: The TED-LIUM corpus was made from audio talks and their transcriptions available on the TED website.
cnh: TED-LIUM cu TED website i chiah mi holh le biatlang le catlang pawl hman in sermi a si.

source: This is approximately the number of hours required to train a production speech-to-text system.
cnh: Hi zat suimilam hi holh-in-ca leh khawhnak dingah computer nih a herh mi zat a si.

source: This is approximately the number of hours required to train a production STT system.
cnh: Hihi STT timi computer nih Laiholh cawnnak ding ah a herh mi suimilam zat a si.

source: This is open source software which can be freely remixed, extended, and improved. Mycroft may be used in anything from a science project to an enterprise software application.
cnh: Mycroft hi hmailei ah tampi in serṭhan le tharchuah khawhnak lam a um. Mycroft cu projecct fa tein siseh sipuaizi tuahnak thil lianpi tiangah hman khawhmi a si.

source: This is our process for translating and adapting our content for many locales (languages).
cnh: Hihi cu an mah le an holhphun cio in ca an lehnak a si.

source: This setting controls your leaderboard visibility. When hidden, your progress will be private. This means your image, user name and progress will not appear on the leaderboard. Note that leaderboard refresh takes ~{ $minutes }min to populate changes.
cnh: Setting nih bawmchantu ṭhawngbik zohnak cu a uk. Na thuh ahcun nangmah lawng nih na tuahmi zat na zoh khawh lai; na hmanthlak, min, le tuahmi cu zohnak ah a lang lai lo. Hruaitu tarnak cu { $minutes } minute dan lawgin a thleng.

source: Three to go!
cnh: Pathum a tang!

source: Today
cnh: Nihin

source: Today's Common Voice progress on clips recorded
cnh: Tuni Common Voice aw tunmi

source: Today's Common Voice progress on clips validated
cnh: Tuni Common Voice check cangmi

source: Today's Progress
cnh: Nihin tuahmi

source: To make it into the Common Voice dataset, a voice clip must be validated by two separate users.
cnh: Tunmi aw cu Common Voice dataset i a luh khawhnak dingah cun minung pahnih nih an chek ta a herh.

source: To make the Common Voice dataset as useful as possible we have decided to only allow source text that is available under a Creative Commons (CC0) license. Using the CC0 standard means its more difficult to find and collect source text, but allows anyone to use the resulting voice data without usage restrictions or authorization from Mozilla. Ultimately, we want to make the multi-language dataset as useful as possible to everyone, including researchers, universities, startups, governments, social purpose organizations, and hobbyists.
cnh: Common Voice i pumhmi data pi hi a si khawh chung in hman awk a tlak nak hna, Creative Commons (CC0) license phung zulh in cakuat hi kan cohlan. CC0 phunglam cu cakuat kawl le khawmh hi a har deuh nain a chuak mi aw data tu hi Mozilla nawl loin fawite hman khawh a si. A bikin, holh kip in pumhmi data hi ahopoah ca hman awktlak a si bik nak hnga kan i tinhmi a si.

source: Top Contributors
cnh: Bawmtu Ṭhawngcem

source: Total
cnh: Dihlak

source: Total Approved
cnh: Lungtlinmi Dihlak

source: Total Hrs
cnh: Suimilam Dihlak

source: Toward next goal
cnh: Hmailei tinhmi

source: Track progress here and on your stats page.
cnh: Na ṭhanchonak hi ka hin zoh.

source: Turkish
cnh: Turkey holh

source: Ubykh
cnh: Ubykh holh

source: Udmurt
cnh: Udmurt holh

source: Ukrainian
cnh: Ukraine holh

source: Unable to speak right now?
cnh: Holh kho lo?

source: Upload
cnh: Khumh

source: Upload aborted. Do you want to delete your recordings?
cnh: Thun ṭhan hlah. Na tuun mi hlonh na duh maw?

source: Upload an image file
cnh: Hmanthlak van khumh

source: Urdu
cnh: Urdu holh

source: Users validate the accuracy of donated clips, checking that the speaker read the sentence correctly.
cnh: Aw tuntu nih biatlang ṭhate le hmante in a rel maw rel lo midnag nih rak chek a si.

source: Using Common Voice
cnh: Common Voice hmanning

source: Uzbek
cnh: Uzbekistan holh

source: Validated Clips
cnh: Check cangmi

source: Validated Hours
cnh: Check cangmi suimilam

source: Validated Hrs
cnh: Suimilam Dihlak

source: Validated Hr. Total
cnh: Chek cangmi suimilam

source: Validating donated clips is equally important to the Common Voice mission. Take a listen and help us create quality open source voice data.
cnh: Tuncia mi aw chek hi Common Voice caah a biapi tuk ve mi rian a si. An aw ngai hna law a ṭha le ṭha lo chek rak kan bawm ve.

source: Validations
cnh: Chek cangmi

source: Venetian
cnh: Venetian holh

source: Version
cnh: A phun

source: Vietnamese
cnh: Vietnam Holh

source: View your progress against personal and project goals.
cnh: Na tuahmi hi midang le riandang a tuah ve mi hna he zohchih hna.

source: Visible
cnh: Langhter

source: Voice clips are entered into a submission queue that readies them for listening.
cnh: Aw-tun mi cu a chektu caah timh cia tein chiah cia a si.

source: Voice is natural, voice is human. It’s the easiest and most natural way to communicate. We want developers to be able to build amazing things from real-time translators to voice-enabled administrative assistants. But right now there isn’t enough publicly available data to build these kinds of apps. We hope that Common Voice will give developers what they need to innovate.
cnh: Aw cu kokek a si, Aw cu minung a si. I chawnh khenh nak caah a fawi cemmi le hmancem mi a si. Computer thiam nih hi thil chung in hman awktlak thil ṭha, holh leh/ca leh le a dangdang bawmtu ah an ser khawh nak ding hi kan duh. Asinain, a tu ahcun mipi nih hman khawh ding mi hi a um lo. Laimi computer thiam pawl nih thil ṭhaṭha an sernak ah Common Voice nih hin a bawmh khawh hna lai tihi kan i ruahchan.

source: Voice is natural, voice is human. That’s why we’re excited about creating usable voice technology for our machines. But to create voice systems, developers need an extremely large amount of voice data.
cnh: Aw le holh cu a sunglawi tuk. Cucaah, computer ah hman khawh dingmi Laiholh ser lai hi kan i ngaih tuk. Hi kan tuah khawhnak ding caah cun, Aw hi tamtuk hringhren tun kan herh.

source: Voice is natural, voice is human. That’s why we’re fascinated with creating usable voice technology for our machines. But to create voice systems, an extremely large amount of voice data is required.
cnh: Aw le holh cu a sunglawi tuk. Cucaah, computer ah hman khawh dingmi Laiholh ser lai hi kan i ngaih tuk. Hi kan tuah khawhnak ding caah cun, Aw hi tamtuk hringhren tun kan herh.

source: Voice recognition technology could revolutionize the way we interact with machines, but the currently available systems are expensive and proprietary. Common Voice is a project to make voice recognition technology easily accessible to everyone. People donate their voices to a massive database that will let anyone quickly and easily train voice-enabled apps. All voice data will be available to developers.
cnh: Common Voice nih kan i tinhmi cu a mikip caah fawi tein mah le holh cio in computer hmanter khawh hi a si. Cucu, mi tampi nih an Aw khumh cio in khulrang te le fawi tein holhphun kip holh a thiam mi computer thilri ser khawhnak a si. Kan tuahmi vialte hi mipi nih man loin hman khawh dih a si lai.

source: Voice recognition technology is revolutionizing the way we interact with machines, but the currently available systems are expensive and proprietary. Common Voice is part of Mozilla’s initiative to make voice recognition technologies better and more accessible for everyone. Common Voice is a massive global database of donated voices that lets anyone quickly and easily train voice-enabled apps in potentially every language. We're not only collecting voice samples in widely spoken languages but also in those with a smaller population of speakers. Publishing a diverse dataset of voices will empower developers, entrepreneurs, and communities to address this gap themselves. In addition to the Common Voice dataset, we’re also building an open source speech recognition engine called Deep Speech.
cnh: Holh in computer kan chawnh khawhnak nih hin zeitin dah computer he kan i pehtlaih ti hi biatak tein a kan thlen, a sinain hman khawh mi pawl cu an man fak tuk i holh tam piin an ngah rih lo. Common Voice cu Mozzila nih a tuahmi, a holhphun kip in computer chawnh khawhnak dingah a si. Common Voice cu vawleicung mikip nih fawi tein an aw an tunnak database a nganpi a si.

source: Voice recording in progress
cnh: Na aw na tun lio

source: Voices Online Now
cnh: Atulio A Zohtu

source: Votic
cnh: Votic holh

source: VoxForge was set up to collect transcribed speech for use with Free and Open Source Speech Recognition Engines.
cnh: VoxForge cu mikip nih zalong tele tling tein computer Aw phun an hman khawh nak caah holhphun pumhnak ah hman mi a si.

source: Want to change your voice clip?
cnh: Na tuncia mi thlen na duh maw?

source: Want to help make Common Voice even better? Great! Get in touch via email or on <discourseLink>Discourse</discourseLink>, submit feedback through <githubLink>GitHub</githubLink>, or join us on <slackLink>Slack</slackLink>.
cnh: Common Voice ṭhat ter deuh na duh maw? <discourseLink> Discourse</discourseLink> ah na ruahnak kan kua, <githubLink>GitHub</githubLink> ah na ruahnak rak ṭial, silole <slackLink> Slack</slackLink> ah rak kan telpi.

source: Want updates when we release a new version of the Common Voice dataset? Subscribe to our newsletter.
cnh: Common Voice dataset a thar kan thlah paoh ah cakuat hmuh na duh maw? Kan thawngthanhnak ah i tel.

source: We are building an open and publicly available dataset of voices that everyone can use to train speech-enabled applications.
cnh: Holh thiamnak he pehtlaih in mipi caah a sunglawi mi Aw phunkip laak in mipi caah data lianpi kan ser.

source: We at Mozilla are building a community around voice technology. We would like to stay in touch with updates, new data sources and to hear more about how you're using this data.
cnh: Holh phunkip in computer a ngahnak ding hi kan nih Mozilla kampani nih kan i tinh mi cu asi. Zei tiin dah hihi na hman timi le thilthar pawl kan ngeih tikah in chimh ve kan duh.

source: We believe that large and publicly available voice datasets foster innovation and healthy commercial competition in machine-learning based speech technology. This is a global effort and we invite everyone to participate. Our aim is to help speech technology be more inclusive, reflecting the diversity of voices from around the world.
cnh: Mipi caah sunglawi ngai le ṭha ngai in Aw lei pumhmi data nih hin a ngandam mi chawleh thalnak le computer chimh cawnpiaknak duhnak hi a chuah pi tiah kan zumh. Hihi miphun kip le ramkip fonh in rak i tal ve uh ti hi kan in sawm hna. Kan vawlei pi ah Aw sunglawi in holh phunkip a um mi hi i tal dih hna sih ti hi kan saduh thah a si.

source: We believe that large, publicly available voice datasets will foster innovation and healthy commercial competition in machine-learning based speech technology. Common Voice’s multi-language dataset is already the largest publicly available voice dataset of its kind, but it’s not the only one. Look to this page as a reference hub for other open source voice datasets and, as Common Voice continues to grow, a home for our release updates.
cnh: Mipi nih hman awktlak Aw-lei fimthiamnak nih hin hmailei ah a ngan dam mi sipuaizi tuahnak le thilthar ser duhnak tampi a chuah ter lai kan zumh. Common Voice's multi-language dataset cu, mipi caah hman khawhmi, vawlei cungah a ngan cemmi dataset pakhat ah a chuah cang. Hmailei zongah thil ṭhaṭha tampi chuah le ser kan i tim rih.

source: We calculate hours by estimating the average length of each recording, and then multiplying that number by the total number of recordings across all languages.
cnh: Suimilam kan tuaktan ning hi aw-tun mi a tawi sau zoh in holh vialte caah khumh mi zat in kan karh.

source: We don't have anything to validate in this language, help us fill the queue.
cnh: Zeihmanh hi holh in tunmi kan ngei rih lo, na aw rak tuun ve.

source: Weekly
cnh: Zarhchiar

source: Weekly Goal
cnh: Zarhfatin tinhmi

source: Welcome { $company } staff!
cnh: { $company } rianṭuan kan in don!

source: Welsh
cnh: Wales holh

source: We promise to handle your information with care. Read more in our <privacyLink>Privacy Notice</privacyLink>.
cnh: Nangmah kong midang kan theih ter hna lai lo. <privacyLink>Privacy Notice</privacyLink> ah hin rel chap.

source: We’re building an open source, multi-language dataset of voices that anyone can use to train speech-enabled applications.
cnh: Mipi caah a sunglawimi, holh phun kip in chawnh khawh dingmi, computer application ser kan i tim.

source: We’re crowdsourcing an open-source dataset of voices. Donate your voice, validate the accuracy of other people’s clips, make the dataset better for everyone.
cnh: Minung tampi sin in aw-cawi pawl hi khawmh an si. Aw rak tun, midang aw-tun mi rak chek. Cuticun mi zapi caah a sunglawimi thilṭha kan ser lai.

source: We’re sorry, but your platform is not currently supported.
cnh: Kan ngai thiam, na tuahnak hi a ngah lo.

source: We've just launched a new contribution experience
cnh: Thil thar kan van thlah ṭhan.

source: We want the audio quality to reflect the audio quality a speech-to-text engine will see in the wild. Thus, we want variety. This teaches the speech-to-text engine to handle various situations—background talking, car noise, fan noise—without errors.
cnh: Na Aw cu computer nih a theih khawh ding hi a biapi. Na mawṭaw chung na um lio, pangka a awn lio, le na hnulei in midang an rak i chawnh lio tibantuk zong an ṭha ṭhiamṭhiam ko.

source: We want the Common Voice dataset to reflect the audio quality a speech-to-text engine will hear in the wild, so we’re looking for variety. In addition to a diverse community of speakers, a dataset with varying audio quality will teach the speech-to-text engine to handle various real-world situations, from background talking to car noise. As long as your voice clip is intelligible, it should be good enough for the dataset.
cnh: Common Voice nih holh-in-ca ah a leh khawhnak dingah a phunkip in tunmi aw hi kan herh ko. A hlei in, miphun tampi i cawhnak zatlangbu nih an awkip an tun cio ahcun cucu computer kan cawnpiaknak ah a thiamnak le a theih hngalhnak a sang chinchin hnga.

source: We will be in touch with more information about how to add your language to Common Voice very soon.
cnh: Na holh zei tiin dah Common Voice ah na chiah ve lai ti kan in chimh tthan te lai.

source: We will be in touch with more information as it becomes available.
cnh: Thil thar kan tuah mi kan in chimh lengmang lai.

source: We will not make your email public.
cnh: Na email mipi sinah kan langhter lai lo.

source: We will review your request to remove your voice recordings from the dataset. If your request is approved, we will contact those who have downloaded the dataset and request they remove your voice recordings as well.
cnh: Na aw data chungin tunmi hlonh dingin ca na kan kuat ahcun kan in zoh piak lai. Hlonh awkah a tlak ko kan ti ahcun kan data a dawnlok tu vialte na aw hlonh dingin ca kan kuat chih hna lai.

source: What does it mean that I can’t “determine the identity” of speakers in the Common Voice dataset?
cnh: Common Voice i pumhmi data aw-tun mi check nah ah "a minung kai fiang lo" timi zeidah a chim duhnak a si?

source: What is Common Voice?
cnh: Common Voice cu zei dah a si?

source: What issues are you experiencing with this sentence?
cnh: Zei bantuk tlamtling lonak dah hi biatlang nih a ngeih?

source: What is the level of quality needed for the audio in order to be used?
cnh: Zei tluk in dah ka Aw hi a fiang a herh?

source: What level of audio quality is required for a voice clip to be used in the dataset?
cnh: Pumhmi Data ah hman awktlak aw-tun a sinak hnga zeibantuk in i tun a herh?

source: What’s inside the Common Voice dataset?
cnh: Common Voice dataset chungah zeidah a um?

source: What's Public?
cnh: Zeidah mipi sinah a lang?

source: What’s the difference between Common Voice and Deep Speech?
cnh: Common le Deep Speech ai dannak hi zeidah a si?

source: When a user rejects a voice clip it returns to the Queue. If rejected a second time, the voice clip is moved to the Clip Graveyard.
cnh: Bawmtu nih aw-tun mi cu a ṭha lo an ti ahcun Queue ah khirh a si. A voihnihnak cohlan lo si cun, thlanmual timi ah hlonh a si.
